//=============================================================================
//
// チュートリアル処理 [tutorial.h]
// Author : Takuto Ishida
//
//=============================================================================
#ifndef _TUTORIAL_H_
#define _TUTORIAL_H_

#include "scene.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CLogoPressButton;
class CScene2D;

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CTutorial : public CScene
{
public:
	CTutorial();
	~CTutorial();
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

private:
	LPDIRECT3DTEXTURE9	m_pTexture;				// テクスチャへのポインタ
	int					m_nFlash;				// 点滅用
	CLogoPressButton	*m_pPressButton;		// 入力待ち表示
	CScene2D			*m_pPolygon;			// 一枚絵
};

#endif