//=============================================================================
//
// ライト処理 [light.h]
// Author : Takuto Ishida
//
//=============================================================================
#ifndef _LIGHT_H_
#define _LIGHT_H_

#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MAX_LIGHT	(3)

//*****************************************************************************
// 前方宣言
//*****************************************************************************

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CLight
{
public:
	CLight();
	~CLight();
	void Init(void);
	void Uninit(void);
	void Update(void);

	static D3DXVECTOR3 GetDirection(void) { return m_alight[0].Direction; };

private:
	static D3DLIGHT9 m_alight[MAX_LIGHT];	// ライトの情報
	int m_nSelectLight;						// 選択中のライト
	D3DXVECTOR3 m_direct[MAX_LIGHT];
	float m_fAngle[MAX_LIGHT];
};

#endif
